{
    "0": "數學\n數學是利用符號語言研究數量、結構、變化以及空間等概念的一門學科，從某種角度看屬於形式科學的一種。數學透過抽象化和邏輯推理的使用，由計數、計算、量度和對物體形狀及運動的觀察而產生。數學家們拓展這些概念，為了公式化新的猜想以及從選定的公理及定義中建立起嚴謹推導出的定理。\n基礎數學的知識與運用總是個人與團體生活中不可或缺的一環。對數學基本概念的完善，早在古埃及、美索不達米亞及古印度內的古代數學文本便可觀見，而在古希臘那裡有更為嚴謹的處理。從那時開始，數學的發展便持續不斷地小幅進展，至16世紀的文藝復興時期，因爲新的科學發現和數學革新兩者的交互，致使數學的加速發展，直至今日。數學併成爲許多國家及地區的教育範疇中的一部分。\n今日，數學使用在不同的領域中，包括科學、工程、醫學和經濟學等。數學對這些領域的應用通常被稱為應用數學，有時亦會激起新的數學發現，並導致全新學科的發展，例如物理學的實質性發展中建立的某些理論激發數學家對於某些問題的不同角度的思考。數學家也研究純數學，就是數學本身的實質性內容，而不以任何實際應用為目標。雖然許多研究以純數學開始，但其過程中也發現許多應用之處。\n西方語言中“數學”（）一詞源自於古希臘語的（），其有“學習”、“學問”、“科學”，以及另外還有個較狹義且技術性的意思－「數學研究」，即使在其語源內。其形容詞（），意思為\"和學習有關的\"或\"用功的\"，亦會被用來指\"數學的\"。其在英語中表面上的複數形式，及在法語中的表面複數形式'，可溯至拉丁文的中性複數'，由西塞羅譯自希臘文複數（），此一希臘語被亞里士多德拿來指「萬物皆數」的概念。\n漢字表示的「數學」一詞大約產生於中國宋元時期。多指象數之學，但有時也含有今天上的數學意義，例如，秦九韶的《數學九章》（《永樂大典》記，即《數書九章》也被宋代周密所著的《癸辛雜識》記爲《數學大略》）、《數學通軌》（明代柯尚遷著）、《數學鑰》（清代杜知耕著）、《數學拾遺》（清代丁取忠撰）。直到1939年，經過中國數學名詞審查委員會研究“算學”與“數學”兩詞的使用狀況後，確認以“數學”表示今天意義上的數學含義。\n數學有着久遠的歷史。它被認為起源於人類早期的生產活動：中國古代的六藝之一就有「數」，數學一詞在西方有希臘語詞源（mathematikós），意思是“學問的基礎”，源於（máthema，“科學，知識，學問”）。\n史前的人類就已嘗試用自然的法則來衡量物質的多少、時間的長短等抽象的數量關係，比如時間單位有日、季節和年等。算術（加減乘除）也自然而然地產生了。古代的石碑及泥版亦證實了當時已有幾何的知識。\n更進一步則需要寫作或其他可記錄數字的系統，如符木或於印加帝國內用來儲存數據的奇普。歷史上曾有過許多不同的記數系統。\n在最初有歷史記錄的時候，數學內的主要原理是為了做稅務和貿易等相關計算，為瞭解數字間的關係，為了測量土地，以及為了預測天文事件而形成的。這些需要可以簡單地被概括爲數學對數量、結構、空間及時間方面的研究。\n到了16世紀，算術、初等代數以及三角學等初等數學已大體完備。17世紀變量概念的產生使人們開始研究變化中的量與量的互相關係和圖形間的互相變換，微積分的概念也在此時形成。隨着數學轉向形式化，爲研究數學基礎而產生的集合論和數理邏輯等也開始發展。數學的重心從求解實際問題轉變到對一般形式上的思考。\n從古至今，數學便一直不斷地延展，且與科學有豐富的相互作用，兩者的發展都受惠於彼此。在歷史上有著許多數學發現，並且直至今日都不斷地有新的發現。據Mikhail B. Sevryuk於2006年1月的期刊中所說，「存放於數學評論資料庫中論文和書籍的數量自1940年（數學評論的創刊年份）現已超過了一百九十萬份，而且每年還增加超過七萬五千份。此一學海的絕大部份為新的數學定理及其證明。」\n每當有涉及數量、結構、空間及變化等方面的困難問題時，通常就需要用到數學工具去解決問題，而這往往也拓展了數學的研究範疇。一開始，數學的運用可見於貿易、土地測量及之後的天文學。今日，所有的科學都存在著值得數學家研究的問題，且數學本身亦給出了許多的問題。牛頓和萊布尼茲是微積分的發明者，費曼發明瞭費曼路徑積分，這是推理及物理洞察二者的產物，而今日的弦理論亦引申出新的數學。一些數學只和生成它的領域有關，且用來解答此領域的更多問題。但一般被一領域生成的數學在其他許多領域內也十分有用，且可以成為一般的數學概念。即使是「最純的」數學通常亦有實際的用途，此一非比尋常的事實，被1963年諾貝爾物理獎得主維格納稱為「數學在自然科學中不可想像的有效性」。\n如同大多數的研究領域，科學知識的爆發導致了數學的專業化。主要的分歧為純數學和應用數學。在應用數學內，又被分成兩大領域，並且變成了它們自身的學科——統計學和電腦科學。\n許多數學家談論數學的\"優美\"，其內在的美學及美。「簡單」和「一般化」即為美的一種。另外亦包括巧妙的證明，如歐幾裏得對存在無限多質數的證明；又或者是加快計算的數值方法，如快速傅立葉變換。高德菲·哈羅德·哈代在《一個數學家的自白》一書中表明他相信單單是美學上的意義，就已經足夠作為純數學研究的正當理由。\n我們現今所使用的大部分數學符號在16世紀後才被發明出來的。在此之前，數學以文字的形式書寫出來，這種形式會限制了數學的發展。現今的符號使得數學對於專家而言更容易掌握，但初學者卻常對此感到怯步。它被極度的壓縮：少量的符號包含著大量的訊息。如同音樂符號一般，現今的數學符號有明確的語法，並且有效地對訊息作編碼，這是其他書寫方式難以做到的。符號化和形式化使得數學迅速發展，並幫助各個科學領域建立基礎支撐理論。\n數學語言亦對初學者而言感到困難。如“或”和“只”這些字有著比日常用語更精確的意思。亦困惱著初學者的，如“開放”和“域”等字在數學裡有著特別的意思。數學術語亦包括如“同胚”及“可積性”等專有名詞。但使用這些特別符號和專有術語是有其原因的：數學需要比日常用語更多的精確性。數學家將此對語言及邏輯精確性的要求稱為「嚴謹」。但在現實應用中，捨棄一些嚴謹性往往會得到更好的結果。\n嚴謹是數學證明中很重要且基本的一部份。數學家希望他們的定理以系統化的推理依著公理被推論下去。這是為了避免依著不可靠的直觀而推出錯誤的「定理」，而這情形在歷史上曾出現過許多的例子。在數學中被期許的嚴謹程度因著時間而不同：希臘人期許著仔細的論證，但在牛頓的時代，所使用的方法則較不嚴謹。牛頓為瞭解決問題所做的定義，到了十九世紀才重新以小心的分析及正式的證明來處理。今日，數學家們則持續地在爭論電腦輔助證明的嚴謹度。當大量的計算難以被驗證時，其證明亦很難說是足夠地嚴謹。\n公理在傳統的思想中是「不證自明的真理」，但這種想法是有問題的。在形式上，公理只是一串符號，其只對可以由公理系統導出的公式之內容有意義。希爾伯特計劃即是想將所有的數學放在堅固的公理基礎上，但依據哥德爾不完備定理，每一相容且能蘊涵皮亞諾公理的公理系統必含有一不可決定的公式；因而所有數學的最終公理化是不可能的。儘管如此，數學常常被想像成只是某種公理化的集合論，在此意義下，所有數學敘述或證明都可以寫成集合論的公式。\n卡爾·弗里德里希·高斯稱數學為「科學的皇后」。在拉丁原文'，以及其德語'中，對應於「科學」的單字的意思皆為知識（領域）。而實際上，science一詞在英語內本來就是這個意思，且無疑問地數學在此意義下確實是一門「科學」。將科學限定在自然科學則是在此之後的事。若認為科學是隻指物理的世界時，則數學，或至少是純數學，不會是一門科學。愛因斯坦曾如此描述：「數學定律越和現實有關，它們越不確定；若它們越是確定的話，它們和現實越不會有關。」\n許多哲學家相信數學在經驗上不具可否證性，且因此不是卡爾·波普爾所定義的科學。但在1930年代時，在數理邏輯上的重大進展顯示數學不能歸併至邏輯內，且波普爾推斷「大部份的數學定律，如物理及生物學一樣，是假設演繹的：純數學因此變得更接近其假設為猜測的自然科學，比它現在看起來更接近。」然而，其他的思想家，如較著名的拉卡託斯，便提供了一個關於數學本身的可否證性版本。\n另一觀點則為某些科學領域（如理論物理）是其公理為嘗試著符合現實的數學。而事實上，理論物理學家齊曼（John Ziman）即認為科學是一種公眾知識，因此亦包含著數學。在任何的情況下，數學和物理科學的許多領域都有著很多相同的地方，尤其是從假設所得的邏輯推論之探索。直覺和實驗在數學和科學的猜想建構上皆扮演著重要的角色。實驗數學在數學中的重要性正持續地在增加，且計算和模擬在科學及數學中所扮演的角色也越來越加重，減輕了數學不使用科學方法的缺點。在史蒂芬·沃爾夫勒姆2002年的著作《一種新科學》中他提出，計算數學應被視為其自身的一科學領域來探索。\n數學家對此的態度並不一致。一些研究應用數學的數學家覺得他們是科學家，而那些研究純數學的數學家則時常覺得他們是在一門較接近邏輯的領域內工作，且因此基本上是個哲學家。許多數學家認為稱他們的工作是一種科學，是低估了其美學方面的重要性，以及其做為七大博雅教育之一的歷史；另外亦有人認為若忽略其與科學之間的關聯，是假裝沒看到數學和其在科學與工程之間的交互促進了許多在數學上的發展此一事實。這兩種觀點之間的差異在哲學上產生了數學是「被創造」（如藝術）或是「被發現」（如科學）的爭議。大學院系劃分中常見「科學和數學系」，這指出了這兩個領域被看作有緊密聯繫而非同一。實際上，數學家通常會在大體上與科學家合作，但在細節上卻會分開。這亦是數學哲學眾多議題的其中一個。\n如上所述，數學主要的學科最先產生於商業上計算的需要、瞭解數字間的關係、測量土地及預測天文事件。這四種需要大致地與數量、結構、空間及變化（即算術、代數、幾何及分析）等數學上廣泛的子領域相關連著。除了上述主要的關注之外，亦有用來探索由數學核心至其他領域上之間的連結的子領域：至邏輯、至集合論（基礎）、至不同科學的經驗上的數學（應用數學）、及較近代的至不確定性的嚴格研究。\n為了闡明數學基礎，數學邏輯和集合論等領域被發展了出來。\n數學邏輯專注於將數學置在一堅固的公理架構上，並研究此一架構的結果。就其本身而言，其為哥德爾第二不完備定理所屬的領域，而這或許是邏輯中最廣為流傳的成果－總存在一不能被證明而又為真的定理。現代邏輯被分成遞歸論、模型論和證明論，且和理論電腦科學有著密切的關連性，千禧年大獎難題中的P/NP問題就是理論電腦科學中的著名問題。\n數量的研究起於數，一開始為熟悉的自然數及整數與被描述在算術內的自然數及整數的算術運算。整數更深的性質於數論中有詳細的研究，此一理論包括瞭如費馬最後定理等著名的結果。數論還包括兩個被廣為探討的未解問題：孿生質數猜想及哥德巴赫猜想。\n當數系更進一步發展時，整數被視為有理數的子集，而有理數則包含於實數中，連續的量即是以實數來表示的。實數則可以被進一步廣義化成複數。數的進一步廣義化可以持續至包含四元數及八元數。從自然數亦可以推廣到超限數，它形式化了計數至無限的這一概念。另一個研究的領域為大小，這個導致了基數和之後對無限的另外一種概念：阿列夫數，它允許無限集合之間的大小可以做有意義的比較。\n許多如數及函數的集合等數學物件都有著內含的結構。這些物件的結構性質被探討於羣、環、-{zh-cn:域;zh-tw:體}-等抽象系統中，該些物件事實上也就是這樣的系統。此為代數的領域。在此有一個很重要的概念，即廣義化至向量空間的向量，它於線性代數中被研究。向量的研究結合了數學的三個基本領域：數量、結構及空間。向量分析則將其擴展至第四個基本的領域內，即變化。\n創立於二十世紀三十年代的法國的布爾巴基學派認爲：純粹數學，是研究抽象結構的理論。\n結構，就是以初始概念和公理出發的演繹系統。\n布爾巴基學派認爲，有三種基本的抽象結構：代數結構（羣，環，域……），序結構（偏序，全序……），拓撲結構（鄰域，極限，連通性，維數……）。\n空間的研究源自於幾何－尤其是歐幾里得幾何。三角學則結合了空間及數，且包含有著名的勾股定理。現今對空間的研究更推廣到了更高維的幾何、非歐幾裏得幾何（其在廣義相對論中扮演著核心的角色）及拓撲學。數和空間在解析幾何、微分幾何和代數幾何中都有著很重要的角色。在微分幾何中有著纖維叢及流形上的微積分等概念。在代數幾何中有著如多項式方程的解集等幾何物件的描述，結合了數和空間的概念；亦有著拓撲羣的研究，結合了結構與空間。李羣被用來研究空間、結構及變化。在其許多分支中，拓撲學可能是二十世紀數學中有著最大進展的領域，並包含有存在已久的龐加萊猜想，以及有爭議的四色定理。龐加萊猜想已在2006年確認由俄羅斯數學家格里戈裏·佩雷爾曼證明，而四色定理已在1976年由凱尼斯·阿佩爾和沃夫岡·哈肯用電腦證明，而從來沒有由人力來驗證過。\n瞭解及描述變化在自然科學裡是一普遍的議題，而微積分更為研究變化的有利工具。函數誕生於此，做為描述一變化的量的核心概念。對於實數及實變函數的嚴格研究為實分析，而複分析則為複數的等價領域。黎曼猜想－數學最基本的未決問題之一－便是以複分析來描述的。泛函分析注重在函數的（一般為無限維）空間上。泛函分析的眾多應用之一為量子力學。許多的問題很自然地會導出一個量與其變化率之間的關係，而這在微分方程中被研究。在自然界中的許多現象可以被動力系統所描述；混沌理論則是對系統的既不可預測而又是決定的行為作明確的描述。\n離散數學是指對理論電腦科學最有用處的數學領域之總稱，這包含有可計算理論、計算複雜性理論及資訊理論。可計算理論檢驗電腦的不同理論模型之極限，這包含現知最有力的模型－圖靈機。複雜性理論研究可以由電腦做為較易處理的程度；有些問題即使理論是可以以電腦解出來，但卻因為會花費太多的時間或空間而使得其解答仍然不為實際上可行的，儘管電腦硬體的快速進步。最後，資訊理論專注在可以儲存在特定媒介內的資料總量，且因此有壓縮及熵等概念。\n作為一相對較新的領域，離散數學有許多基本的未解問題。其中最有名的為P/NP問題－千禧年大獎難題之一。一般相信此問題的解答是否定的。\n應用數學思考將抽象的數學工具運用在解答科學、工商業及其他領域上之現實問題。應用數學中的一重要領域為統計學，它利用機率論為其工具並允許對含有機會成分的現象進行描述、分析與預測。大部份的實驗、調查及觀察研究需要統計對其資料的分析。（許多的統計學家並不認為他們是數學家，而比較覺得是合作團體的一份子。）數值分析研究有什麼計算方法，可以有效地解決那些人力所限而算不出的數學問題；它亦包含了對計算中捨入誤差或其他來源的誤差之研究。\n數學獎通常和其他科學的獎項分開。數學上最有名的獎為菲爾茲獎，創立於1936年，每四年頒獎一次。它通常被認為是數學的諾貝爾獎。另一個國際上主要的獎項為阿貝爾獎，創立於2003年。兩者都頒獎於特定的工作主題，包括數學新領域的創新或已成熟領域中未解決問題的解答。著名的23個問題，稱為希爾伯特的23個問題，於1900年由德國數學家大衛·希爾伯特所提出。這一連串的問題在數學家之間有著極高的名望，且至少有九個問題已經被解答了出來。另一新的七個重要問題，稱為千禧年大獎難題，發表於2000年。對其每一個問題的解答都有著一百萬美元的獎金，而當中只有一個問題（黎曼猜想）和希爾伯特的問題重複。\n",
    "1": "哲學\n哲學（）是研究普遍的、根本的問題的學科，包括存在、知識、價值、理智、心靈、語言等領域。哲學與其他學科的不同是其批判的方式、通常是系統化的方法，並以理性論證為基礎。在日常用語中，其也可被引申爲個人或團體的最基本信仰、概念或態度。\n英語詞語（）源於古希臘語中的，意思為「愛智慧」，有時也譯爲「智慧的朋友」，該詞由（philos，愛）的派生詞（Philein，去愛）和（Sophia，智慧）組合而成。一般認爲，古希臘思想家畢達哥拉斯最先在著作中引入“哲學家”和“哲學”這兩個術語。\n“哲”一詞在中國起源很早，如“孔門十哲”，“古聖先哲”等詞，“哲”或“哲人”，專指那些善於思辨，學問精深者，即西方近世“哲學家”，“思想家”之謂。在《易經》當中已經開始討論哲學問題，形而上學的中文名稱取自《易經·繫辭上傳》「形而上者謂之道，形而下者謂之器」一語。1874年，日本啟蒙家西周，在《百一新論》中首先用漢文「哲學」來翻譯\"philosophy\"一詞。\n英國哲學家羅素對哲學的定義是：\n胡適在《中國哲學史大綱》中稱「凡研究人生切要的問題，從根本上着想，要尋一個根本的解決：這種學問叫做哲學」。\n雖然哲學源自西方的傳統，但許多文明在歷史上都存在著一些相似的論題。東亞和南亞的哲學被稱之為東方哲學，而北非和中東則因為其和歐洲密切的互動，因此常被視為是西方哲學的一部份。\n對哲學的主題亦存在許多看法。一些人認為哲學是對問題本身過程的審查；另外一些人則認為實質上存在著哲學必須去回答的哲學命題。\n古希臘哲學家透過問問題來進行哲學實踐，他們所提的問題大概可以歸類為三類，這三類問題分別形成了哲學的基礎學科——分別是形而上學、倫理學、認識論（或知識論） 。\n哲學可以分爲很多不同的分支，主要包括形而上學、知識論、倫理學、邏輯學和美學。\n很多人類社羣思考過哲學問題並且互相學習建立了各種哲學流派。\n東方哲學是通過每個地區的歷史時期來組織的。西方哲學一般可以分爲三個或更多時期，最重要的是古典哲學、中世紀哲學和近代哲學。\n印度哲學的歷史源遠流長，早在吠陀時代已經開始，至公元前6世紀為全盛時期。當時古印度的思想界百花齊放，其中最著名的包括佛教創始人釋迦牟尼佛、耆那教創始人笩駄摩那、阿耆多·翅舍欽婆羅、波拘陀·迦旃延、富蘭那·迦葉、數論派等。\n中國哲學的主要部分起源東周時期，當時以諸子百家廣爲人知，以孔子的儒家、老子的道家、墨子的墨家及晚期的法家為代表，還有一些流派例如農家、陰陽家和名家在之後則名聲不顯。在秦朝焚書坑儒後除了法家、儒家、道家外其他流派都不再活躍。\n古希臘-哲學是西方哲學的一個時期，時間爲公元前6世紀[約585]到公元6世紀。它一般被分爲三個時期：前蘇格拉底時期、柏拉圖和亞里士多德的古典希臘時期、和後亞里士多德（或希臘化）時期：有時候會把新柏拉圖主義和基督教哲學家們的古典時代晚期加入作爲第四個時期。\n在公元前6世紀的希臘，西方哲學就從古代神話和詩歌中脫穎而出，逐步開始對宇宙的組成以及本源的思考而開始了獨立發展。前蘇格拉底時期的自然派哲學家們多關注自然界，被認為是西方最早的哲學家，不管他們認識以及解釋世界的方式是否正確，但是他們的想法之所以有別於迷信的原因在於，這些哲學家是以理性輔佐證據的方式歸納出自然界的現象。諸如：\n公元前5世紀中期，普羅泰戈拉和高爾吉亞等所形成的辯士學派將研究的重點由自然轉移到人類本身。認爲“人才是萬物之本”。他們都不相信有真正的存在和真理。普羅泰戈拉認爲是非善惡都是相對於人的感覺而言，而高爾吉亞卻認爲所有的都是同樣的假，這是懷疑論的雛形。 \n公元前6世紀末，以畢達哥拉斯爲主的畢達哥拉斯學派所主張的哲學與前述的觀點既相近又有不同。羅馬古代的歷史上記載畢達哥拉斯第一個稱自己爲哲學家，或者說是愛智慧。他認爲“一切都是數字”。其意思就是說一切事物的實質和結構都是它們所包含的數字關係所決定的。他稱平均、秩序和調和是宇宙的三大基調，並以音樂的調和說明宇宙的調和。他所在的學派將宇宙總結爲十種性質相異的組合：有限與無限、奇與偶、一與多、左與右、男與女、靜與動、直與曲、光明與黑暗、善與惡、方與圓。至此之後，數學的本質及其地位，一直都是哲學的主要問題之一，數學不受觀察和實驗造成的不確定性影響，而且是通過純粹的思想加以理解的。\n其中關於變與不變的關係的爭論，真實世界與直覺世界的差別，真理與意見的矛盾，導致產生了認識論的問題。\n在古典希臘時期西方哲學方法的關鍵特質被建立：依靠訴諸理性和論證，通過一種批判性的方法來接受或建立觀點。這包括蘇格拉底被稱爲蘇格拉底反詰法或“反駁論證”方法的辯證法，他主要用其來檢驗例如善良和公平正義的關鍵道德概念。這種方法將一個問題分解成一系列的疑問，在對疑問的回答中逐步提取想要找到的答案，其極大影響可以從現在使用的科學方法中看出，在科學方法中假說是第一個階段。\n蘇格拉底沒有直接教過人，但之後的柏拉圖深受其影響。而其整個哲學思想來源於兩大理論：其一，永遠不要做壞事；其二，一個內心真正善良且正義的人絕不會做相反之事。他認爲真理有其客觀性，試圖推翻智者們以個人主觀感覺爲真理的思想。然後提出德的概念，以作爲人生行事的方向。對於道德是什麼的問題，蘇格拉底的回覆爲“知識即道德。”對於知識是何物的問題，他回答說知識是透過理性而得的概念。蘇格拉底開創了認識論和倫理學，如此奠定了他的哲學地位。\n古典希臘時期的的哲學家中柏拉圖和亞里士多德對後世的影響力最大，特別是柏拉圖被認爲是西方哲學的創始人。哲學家阿爾弗雷德·諾思·懷特黑德評價柏拉圖：“歐洲哲學傳統最被普遍公認的特點，就是它包含了一系列對柏拉圖的註腳。我的意思不是懷疑學者們系統體系的思想是提取自柏拉圖的著作。我暗示的是那些他們散落的一般思想的財富。”換言之即使數千年後，人們依舊在試著回答他所提出的問題，這也代表著人們依然為這些問題或是這些問題所延伸的更多問題而感到困惑。\n畢達哥拉斯的思想對柏拉圖產生了顯著地影響，並通過柏拉圖影響了整個西方哲學。柏拉圖和亞里士多德作爲最早的古典希臘哲學家批判地引用了其它的一些”智者“，當時這些人在希臘被稱爲“辯士”並在畢達哥拉斯之前相當普遍。從他們的批判看來，在他們的古典時代一個在更高尚地、純粹地”愛智慧”（真的哲學家）與那些更早更普遍的旅行教師——經常也通過自己的技藝來賺錢——之間的分水嶺之後被建立。\n亞里士多德死後，整個哲學界陷入了獨立時期，稱爲時期。因爲整個社會和政治陷入混亂。這段時期產生了斯多葛學派和伊壁鳩魯學派，以及懷疑主義派、新柏拉圖派和。這些學派的共同特點是倫理化。斯多葛學派主要是順應自然和自制。伊壁鳩魯學派則是把快樂作爲生活的本質和善的標準。而新柏拉圖派和新畢達哥拉斯派都是帶有宗教主義的哲學，並逐漸產生融化基督教和希臘哲學於一體的理論，即爲後來的基督教哲學。\n直到公元529年，羅馬皇帝查士丁尼一世尼命令關閉雅典的柏拉圖學院。稱一些餘下的學院成員逃入了薩珊王朝首都泰西封。\n印度哲學是指起源於印度次大陸的哲學思想，包括、、等，這些印度哲學具有一些共同且複雜的起源，都有有關佛法及業的主題，而且都希望達到個人的解放。這些哲學約在西元前一世紀到西元幾世紀的時間成形。\n中世紀哲學指的是西歐和中東在中世紀的哲學體系，其時間範圍沒有定論，大致上是從基督化的羅馬帝國時期至文藝復興時期。中世紀哲學被部分定義爲對古典希臘和希臘化哲學的再發現和進一步發展，另一部分是需要解決神學問題並把亞伯拉罕諸教（伊斯蘭教、猶太教和基督教）的教條同世俗知識一同整合並推廣。\n文藝復興人文學者們排斥中世紀時期，把它當作在希臘羅馬的古典時代與古典文化“復興”之間的一個“過渡”的野蠻時期。然而在中世紀這將近一千年中哲學在歐洲仍取得了長足地發展。認爲\"在強度、複雜度還有成就上，可以確信地說哲學在十三世紀的興盛能與公元前四世紀古希臘哲學的黃金時期媲美。\"\n這個時代討論的問題有信仰和理智的關係，神的存在與統一，神學話題和形而上學，關於知識、宇宙和個人的問題。\n中世紀的哲學家包括基督教學者希波的奧古斯丁、波愛修斯、安瑟倫、、皮埃爾·阿伯拉爾、羅吉爾·培根、聖文德、托馬斯·阿奎那、鄧斯·司各脫、奧卡姆的威廉和讓·布里丹等；猶太哲學家邁蒙尼德和;還有穆斯林哲學家肯迪、法拉比、海什木、伊本·西那、安薩裏、伊本·巴哲、、伊本·赫勒敦和伊本·魯世德等。中世紀的經院哲學傳統一直到17世紀仍在活躍，例如和等人物。其中托馬斯主義之父阿奎那極大地影響了整個天主教歐洲，他特別強調理性和論證，是最先開始使用亞里士多德形而上學和知識論的著作的新譯本的學者之一。他的工作明顯遠離了統治大部分早期經院哲學的新柏拉圖主義和奧古斯丁的思想。\n從文藝復興開始，人們的思想開始從清淨的僧院走出，來到喧囂的塵世。從而發展自然，也發展人類自身。從而形成人文主義和自然哲學兩股既有聯繫又有區別的思潮。\n\"文藝復興\"是對中世紀到近代之間過渡時期的通稱，那時對古典文獻的重新學習幫助把哲學界的興趣從對邏輯學、形而上學和神學領域的鑽研轉移到包括道德、語言學和神祕主義的更加廣泛的研究。對經典和人文藝術例如歷史學和文學的研究在基督教世界學術界中享有前所未有的興趣，這個趨勢被稱爲人文主義，它受到柏拉圖主義、希臘懷疑主義和羅馬斯多葛主義的影響。人文主義者的哲學興趣跟隨彼特拉克轉移到造物主與其美德上，替代了中世紀時對形而上學和邏輯學的興趣。\n那時對古典哲學的研究出現了兩種新方式。一方面對亞里士多德的研究因爲的影響而產生了變化。阿威羅伊亞里士多德主義者和更正統的天主教亞里士多德主義者譬如艾爾伯圖斯·麥格努斯和托馬斯·阿奎那之間的分歧最終在文藝復興發展出一種“人文亞里斯多德哲學”，譬如和的思想。另一方面，在一些之前不爲西歐所熟知的作品的重發現的幫助下，對柏拉圖和新柏拉圖主義的研究作爲另一個選擇變得普遍起來。著名的文藝復興時期的柏拉圖主義者包括庫薩的尼古拉，還有之後的馬爾西利奧·費奇諾和若望·皮科·德拉·米蘭多拉。\n文藝復興也重新產生了對反亞里士多德的把自然看作一個有機的、活生生的整體而不取決於神學的理論的興趣，例如在庫薩的尼古拉、尼古拉·哥白尼、焦爾達諾·布魯諾、還有托馬索·康帕內拉的著作中。在自然哲學中這樣的運動與對神祕主義、魔法、赫爾墨斯主義還有占星學等興趣重燃相契合，它們被認爲隱藏着收穫知識和掌控自然方法的大門。\n這些新的哲學運動伴隨着歐洲宗教和政治的劇變同時出現：宗教改革和封建制的衰落。雖然參與宗教改革的神學家們對哲學沒有直接的興趣，他們打破了神學和知識權威的傳統基礎。同時還伴隨着信仰主義和懷疑主義的復興，體現在伊拉斯謨，蒙泰涅和等思想家身上。同時，民族國家政治上逐步的中央集權的過程得到了世俗政治哲學的響應，如尼可羅·馬基亞維利（常被描述爲第一個現代政治思想家，或者是現代政治思想形成的關鍵點）、托馬斯·莫爾、伊拉斯謨、尤斯圖斯·利普修斯、讓·博丹和胡果·格老秀斯等的著作。\n先秦諸子之後的兩漢經學、魏晉玄學等都是中國哲學的一部份，自唐朝起佛教也開始對哲學產生重要影響；不過中世紀中國哲學最主要的部分是宋明理學的發展。\n宋明理學反對漢代後開始影響儒學的道教和佛教中的迷信和神祕的元素，是一股倡導更加理性和世俗化儒學的哲學運動。儘管理學遭到道教和佛教徒的批評，理學仍借鑑了它們兩個的部分術語和概念。然而和佛教和道教把形而上學看作心靈發展、宗教啓示的催化劑並且是不朽的不同，宋明理學把形而上學當作建立一個理性的倫理體系的指導。宋明理學的起源可以追溯到唐朝：韓愈和李翱被視爲宋代理學的先驅。宋代理學家周敦頤以道教形而上學理論爲框架建立了他的倫理哲學體系，他被看作是宋明理學的創始人。\n在東亞的其他地方，日本哲學形成於本土的神道信仰和佛教、儒家以及另一些中國哲學和印度哲學學派混合發展。與日本類似，在中巫教的情緒化內容被混合到了從中國傳入的理學當中。\n主條目：近代哲學\n西方哲學史上的近代早期一般指17世紀和18世紀，其中18世紀常被稱爲啓蒙時代。現代哲學不同於其前身，它和傳統權威例如教會、學院、亞里士多德的關係更加獨立，出現了對知識基礎和形而上學體系建設的新興趣；和擺脫了自然哲學的近代物理學的出現。從17世紀開始，近代哲學就以認識論爲研究重點。由於經驗論（經驗主義）與唯理論（理性主義）的爭論，使物質與精神的關係作爲認識論的首要問題突顯出來。\n當時其他的哲學焦點包括精神的天性和其與身體的關係，新的自然科學對諸如自由意志和神的傳統上屬於神學的話題的影響，和倫理學和政治哲學的世俗基礎\n。這種潮流最早被鮮明地體現在弗蘭西斯·培根的被稱爲用來擴展知識的新的、經驗主義的程序，並很快在笛卡兒的機械主義物理學和理性主義的形而上學中建立了具有巨大影響力的形式。培根運用歸納法，第一個提出思維的主體“人”應該主動干涉自然來爲人服務。\n近現代政治哲學的鼻祖托馬斯·霍布斯最早將這套方法論系統得應用在政治哲學上，包括\"社會契約\"的近代理論。早期近代哲學的學術經典一般包括笛卡爾、斯賓諾莎、萊布尼茨、洛克、貝克萊、休謨和康德。同時其的其他思想家也對哲學做出了貢獻，例如伽利略、皮埃爾·伽桑狄、布萊茲·帕斯卡、馬勒伯朗士、艾薩克·牛頓、、孟德斯鳩、、托馬斯·裏德、讓·勒朗·達朗貝爾和亞當·斯密，而讓-雅克·盧梭是反啓蒙運動的開創性人物。早期近代哲學的大致結束通常被確定爲伊曼努爾·康德的試圖限定形而上學範圍、證明科學知識並用道德和自由來調和兩者的體系。\n理性主義者中勒內·笛卡兒認爲物質世界是由數學關係組成的單一體系，他企圖將物理學轉化爲數學。他在其著作中，對整個經院哲學以及在他那個時代流行的教育與哲學體系加以諷刺。其認爲“我思故我在”是認識論的無可懷疑之出發點。笛卡爾是割裂精神和物質的二元論者，爲了釐清二者關係，他堅定認爲在上帝那裏，精神和物質是統一的。其理論被稱爲笛卡爾主義\n。斯賓諾莎是笛卡爾之後，又一位著名的唯理論者。他的認識論、幾何學和機械觀都來自於笛卡爾。但他不認同笛卡爾的二元論，認爲精神和物質不過是唯一實體的兩種屬性\n。萊布尼茨作爲唯理論者堅定地維護笛卡爾的學說並反駁約翰·洛克的理論。與笛卡爾不同的是，他認爲萬物的實體是“單子”，且互相沒有關係，而是由於“前定和諧”才共存一體，即存在於神之中。“前定和諧”調和了笛卡爾之二元論和斯賓諾莎之實體雙重性。\n洛克發展了經驗論，他不認同笛卡爾的“天賦觀念”，提出白板說，他強調人們從感覺中抽象出普遍的概念，認爲感覺中的個別東西纔是第一位的。不過他基本認同笛卡爾的二元論。貝克萊發展了洛克的哲學理論，提出了“存在就是被感知”。他認爲除了感知的主題和被感知的知覺之外，什麼也沒有。他非常不贊同物質的抽象概念，認爲其既無客觀實在，也不能存在於人心。大衛·休謨的理論比貝克萊的更進一步，他不僅僅認爲物質實體不存在，更認爲精神實體不存在。只承認知覺的存在。他還以自己的不可知論和懷疑論認爲不存在統一性和普遍性的東西，認定多樣性和個別性纔是最高原理。\n經驗論與唯理論的爭論也包含了唯物主義與唯心主義的爭論。在18世紀時，法國的拉美特利公開宣佈唯物主義是唯一的，而百科全書的主編德尼·狄德羅也拒絕承認神的存在。\n另外伏爾泰，孟德斯鳩和其他百科全書派的學者都有涉及政治和倫理領域。他們都認爲機械主義纔是最終形式——物質是唯一的且處於永恆運動的，精神只是人腦的屬性。因此他們認爲無機物與有機物不可逾越，人的思維是人感官的結果。不過他們仍然是經驗主義者，在因果性上，他們認爲只有必然性纔是唯一的，這就成爲唯心主義的觀念。\n從18世紀中後期開始，直到19世紀初，哲學便進入了近代哲學的總結時期，這就是德國古典哲學時期。有兩條線索標誌着轉折的到來：一、思維與存在的關係更加明確；二、產生了系統辯證法。其代表人物有I.康德、J.G.費希特、F.W.謝林、G.W.F.黑格爾等。\n康德給哲學帶來了三個標誌性的創造：\n他受到休謨的諸多影響，併爲西方哲學帶來一次革命。他認爲哲學的研究核心就是規定理性能做什麼以及不能做什麼。\n康德同意休謨的理論並認爲，存在一些原則，使得心靈對經驗和認識加以組織，而證據皆可以在數學中找到。即是，包含在命題裏的要比包含在原是概念的定義要多得多。他使用稱之爲批判哲學的先驗方法，來展現經驗的某些範疇和形式都必然地被預先存在於人們一切言談之中。\n憑藉着他的三部“批判性”的著作，爲先驗方法作出相應的結構：\n他還爲道德哲學奠定了新基礎，且他賦予了自由概念的新意義。因爲其影響在現代依舊尚存，其理論被人們稱爲康德主義。\n費希特本來承認斯賓諾莎的機械的因果決定論，但後來受到康德的影響，開始認爲因果決定論只是表面，其實質爲自我不是必然性的奴僕而是獨立自由的主體。就此，他建立了主觀的思維與客觀的存在之統一說。\n謝林是從費希特理論出發的，但深受斯賓諾莎和文學上浪漫主義的影響，創立了自己的學說。即他認爲自然和精神、存在和思維，客體和主體，表面相反，實則統一，是同一個“絕對”的不同發展階段，這個“絕對”即是萬事萬物的根源。他認爲藝術纔是最直觀的理性。\n黑格爾及其理論的出現將西方哲學的推上一個新高度，他創立了西方哲學史上最龐大的客觀唯心主義體系，並系統地闡述了辯證法。他的理論和學說對近現代哲學產生了很深遠的影響，並被稱爲黑格爾主義。\n從黑格爾的思想體系中發展而成的多種哲學運動。其重點就是以歷史和邏輯爲主，歷史方面，它從不同角度理解“凡是合理的就是現實的”；邏輯方面，它有發現其中所說的“真理即整體”。\n黑格爾認爲哲學的重點是放棄分裂，達到統一。他把以前的時代說成是思維與存在、理想與現實分裂，自由與必然，個人與社會、無限與有限、統一性與多樣性分裂之時代。\n他從康德的“心靈的合理性以及在經驗中的積極作用”的概念出發，但反對康德的“超越經驗世界和‘物自身’的世界”，並認爲心靈和世界一樣具有相同基礎理性結構。他所認爲的普遍性不是脫離特殊的抽象普遍，而是包含特殊在內之普遍，即爲具體普遍；他所認爲的統一也非脫離矛盾、對立的抽象統一，而是包含它們在內的統一，即爲對立統一。上述綜合在一起即是他的理論：最真實的無所不包的整體即是“絕對精神”，又是對立的統一。\n他認爲，爲了達到這個“絕對精神”，需要經過三個階段，從邏輯、自然到精神，即是從思維到存在，再到兩者統一的過程，從而完成他的統一論。\n就此，社會和歷史的現象，便被賦予一種在哲學史上還是嶄新的顯赫地位。他還將倫理學劃歸到這個領域，從而在倫理學理論和對思想的理解中提出重要的路線。\n從19世紀中葉開始，西方哲學就進入現代哲學階段。因爲在19世紀中期，歐洲的工業革命幾近完成。\n現代哲學，特別是19世紀中後期的哲學流派，有叔本華的意志主義，新康德主義，新黑格爾主義，馬克思主義。\n20世紀的西方哲學上主流有兩條：\n現代哲學主要包含以下幾種潮流。\n歷程哲學：\n主流馬克思主義：\n西方馬克思主義：\n革新的黑格爾主義：\n結構主義：\n分析哲學：\n實證主義：\n新康德主義：\n邏輯實證主義：\n語言哲學：\n現象學：\n唯物論：\n新托馬斯主義：\n科學哲學：\n意志主義：\n實用主義：\n存在主義：\n解釋學：\n唯心主義的各種變體在18世紀晚期至20世紀早期的哲學界相當流行。康德主張的先驗唯心主義認爲人們對事物的理解是有界限的，因爲在客觀判斷條件下很多事情是辦不到的。他在1781年發行的作品《純粹理性批判》試圖調和18世紀兩大主要的哲學派別：經驗主義和理性主義，並且建立一個研究形而上學的新基礎。\n德國唯心主義最著名的作品是黑格爾於1807年出版的《精神現象學》。黑格爾承認自己的理念不是新的，不過他的目標是完成之前的哲學家們的不完整的體系。黑格爾認爲哲學的重點是放棄分裂，達到統一。他把以前的時代說成是思維與存在、理想與現實分裂，自由與必然、個人與社會、無限與有限、統一性與多樣性分裂之時代。他從康德的“心靈的合理性以及在經驗中的積極作用”的概念出發，但反對康德的“超越經驗世界和‘物自身’的世界”，並認爲心靈和世界一樣具有相同基礎理性結構。他所認爲的普遍性不是脫離特殊的抽象普遍，而是包含特殊在內之普遍，即爲具體普遍；他所認爲的統一也非脫離矛盾、對立的抽象統一，而是包含它們在內的統一，即爲對立統一。上述綜合在一起即是他的理論：最真實的無所不包的整體即是“絕對精神”，又是對立的統一。黑格爾認爲需要經過三個階段來達到這個“絕對精神”，從邏輯、自然到精神，即是從思維到存在，再到兩者統一的過程，從而完成他的統一論。他還將倫理學劃歸到這個領域，從而在倫理學理論和對思想的理解中提出重要的路線。\n馬克思主義哲學是馬克思和恩格斯建立的以辯證唯物主義爲核心的哲學體系。其認爲實踐是檢驗哲學之真理性的最終標準，哲學應伴隨着社會、科學技術和文化的發展而不斷髮展。其主要思想體系在19世紀70年代主要由恩格斯創立，20世紀20年代在蘇聯形成完整體系——辯證唯物主義和歷史唯物主義，這個體系在後來的社會主義國家推動下得以發展。馬克思主義哲學宣稱自己的理論體系具有科學性，認爲哲學可以成爲科學的一部分。同時馬克思主義哲學認爲哲學還具有意識形態的性質。\n另外馬克思主義在政治上也指各種不同的共產主義運動，如由列寧所創立而被斯大林修改的蘇聯馬克思主義，稱爲馬克思列寧主義，爲俄國革命以及後來建立的各種共產黨之教義。它的旁系包括反斯大林的托洛茨基及其追隨者的馬克思主義、毛澤東的馬克思列寧主義等。\n實用主義產生於19世紀70年代的現代哲學派別，在20世紀的美國成為一種主流思潮。對法律、政治、教育、社會、宗教和藝術的研究產生了很大的影響。實用主義也試圖在理性主義及經驗主義找出一條中間道路來，是「經驗主義思想方法與人類的比較具有宗教性需要的適當的調和者。」\n現象學是由德國哲學家胡塞爾在1900年提出的理論，強調對直接直觀和經驗感知的區分，認為哲學（或至少是現象學）的主要任務是釐清二者之間的關聯，並且在直觀中獲得對本質的認識。\n存在主義是一個哲學的非理性主義思潮，該術語被用在十九世紀晚期到二十世紀的一些哲學家的工作上，儘管他們的學說相差巨大，但他們都相信哲學思考開始於人類主體——不僅僅是思維主體，而且包括行爲、感知、人類個體。存在主義強調個人、獨立自主和主觀經驗，認為人存在的意義是無法經由理性思考而得到答案。在存在主義中，個體的出發點的特徵是被稱爲“存在的態度”，或一種面對顯然是一個無意義的或荒謬的世界的迷失和混亂的感覺。很多存在主義者還認爲傳統的體系和哲學學術無論是內容和風格都過於抽象並遠離人類經驗。\n19世紀哲學家克爾凱郭爾和尼采被看作存在主義的先驅，儘管他們沒有使用這個術語。然而他們的影響延伸出了存在主義思想。克爾凱郭爾著作主要針對的是黑格爾的唯心主義哲學體系，他認爲其忽視或排除了人類的內在主觀生命。相反克爾凱郭爾認爲\"真理是主觀的\"，主張對一個現實的人類來說最重要的問題是處理個人與存在內在關係的問題。克爾凱郭爾作爲一個基督徒相信宗教信仰的真相是一個主觀問題，而且人應該用熱情去深思這個問題。\n",
    "2": "周杰倫（英語：JayChou；1979年1月18日－），臺灣著名華語流行歌曲男歌手、音樂家、唱片製片人。同時是演員、導演，也是電競團隊隊長兼老闆、服飾品牌老闆。以其個人風格和音樂創作能力著稱，影響華語樂壇。在2000年，周杰倫發行了他的首張專輯《Jay》，從屬於唱片公司阿爾發音樂。從此以後，他的音樂獲得了遍及亞洲的榮譽，尤其在臺灣、中國大陸、馬來西亞、香港、新加坡、印度尼西亞、韓國、日本和西方國家——例如美國和澳大利亞——的亞裔群體中。他賣出了超過3000萬張專輯並獲得了許多針對他的音樂工作的獎項。周杰倫在工作與他的專輯時也為其他藝術家寫歌。在2003年，他是《時代》雜誌（亞洲版）的封面故事，被稱為「亞洲流行音樂的新天王」。他其後開展了六個世界巡演，在世界各地的城市中對超過1000萬人表演。周杰倫在電影《頭文字D》（2005）中開始了他的電影事業；他從此涉足許多其他的電影企劃。周杰倫也管理他自己的唱片和經紀公司杰威爾音樂。2011年首度進入好萊塢，主演《青蜂俠》之助理Kato；而後在2016年，他再次進入了好萊塢，在電影《出神入化2》中扮演小李。周杰倫在台灣台北林口長大。父親周耀中，當時任教於台北縣蘆洲國中，教授生物[4]；母親葉惠美則是林口國中美術教師。14歲時父母離異，由父親擔任監護人，年滿18歲後選擇與母親共同生活[5]，周杰倫在台灣民視新聞台由胡婉玲主持的節目《台灣演義》專訪中，澄清《爸，我回來了》的靈感，只是對社會上家暴現象的感慨，並非指涉父母間的狀況，父親方面的親戚也曾質疑過他，他還為此向親戚們澄清，為此誤解抱歉過[6]。周杰倫他自小對音樂表現出濃厚的興趣，而且喜歡模仿歌星、演員表演和變魔術。3歲開始學習鋼琴。周杰倫國小時住在臺北市光華商場附近，就讀忠孝國小。國中時就讀金華國中，此時期他的父母因長年爭執而決議離婚，使周杰倫的性情大受影響。除了音樂外，周杰倫熱愛籃球，他在國中參加籃球隊，結識學長陳建州。在同儕中是高手，球場上的表現常受眾人圍觀。高中就讀於台北縣私立淡江中學第一屆音樂科（本來是想報考華岡藝校，但錯過了報名期間，幸好淡江中學恰巧新設了音樂科），主修鋼琴，副修大提琴，為將來的音樂發展打下了深厚的基礎[7]。這時的他因正值青春期，常常秀琴技想吸引女同學的注意。但學科成績不甚理想，故高中畢業時，大學聯考落榜。又因患有僵直性脊椎炎，依據臺灣兵役制度得以免服義務兵役[8]。周杰倫曾說過表示少年時受到香港樂壇「四大天王」之一張學友的專輯《吻別》的影響，從而喜歡並開始專注於流行音樂[9]。另外他也透漏過，除了張學友以外，李恕權與史帝夫·汪達也是他童年時影響他很深的人，李恕權每回出現在電視上，周杰倫便會在電視機面前模仿他，而史帝夫·汪達有一首《IjustcalledtosayIloveyou》是他的嬸嬸曾在他叔父的葬禮中播放的歌曲。由於他的音樂基礎紮實，令其在流行音樂創作方面如魚得水。周杰倫首次亮相幕前，是在1997年8月，當時是因為高中同學參加TVBS-G的選秀節目《超級新人王》而為朋友擔任鋼琴伴奏。雖然他同學歌唱未獲獎，該節目主持人吳宗憲卻對周杰倫的樂譜作曲工整印象深刻，認為其有潛力進而簽約發掘進入樂壇。吳宗憲非常肯定周杰倫的才華，所以先讓他專注作曲的歷練後再出唱片，雖寫過多首歌曲不過仍有不少曲目未被他人採用而退稿，例如：劉德華《眼淚知道》和張惠妹《忍者》。吳宗憲對周杰倫很肯定也很支持，不僅自己唱片還有公司（阿爾發音樂）多數歌手的歌曲都用他的創作歌曲，還讓他登上所有自己的節目，在各大節目中大力推薦。周杰倫的歌曲很快變成當時非常流行的音樂，日後也成為了真正的亞洲巨星，他也曾說過：「沒有吳宗憲就沒有周杰倫。」。阿爾發音樂中，唯周杰倫作曲與方文山（吳宗憲掘發）作詞的合作作品最受青睞，無形中兩人的合作形成一種絕佳的必勝「定律」了[7]。總經理楊峻榮偶然聽到《可愛女人》的試聽帶後，認為周杰倫可以出片了。在得到老闆吳宗憲的認同後，2000年周杰倫依唱片合約內容創作了五十首歌曲，由吳宗憲欽挑十首，便開始準備製作自己的第一張專輯。吳宗憲提供了新台幣四千萬元作為專輯籌備的部份資金，於當年11月發行周杰倫首張個人專輯《Jay》，並帶著周杰倫在自己的節目上大力曝光行銷。此張專輯具備別於當時市場主流的突破性曲風，風格融合R&B、Hip-Hop、古典和中國風，初步奠定了周杰倫的「周式曲風」和歌手形象[7]。1998年，周杰倫第一首創作歌曲《三暝三日》，由吳宗憲演唱。1999年《落雨聲》是周杰倫第一首賣出的歌，由江蕙演唱，也是第一次和方文山合作的知名作品。2000年周杰倫依唱片合約內容創作了五十首歌曲後，由吳宗憲欽挑十首，就開始準備製作自己的第一張專輯，吳宗憲提供了新台幣四千萬元作為專輯籌備的部份資金，於當年11月發行周杰倫首張個人專輯《Jay》，並帶周杰倫在自己的節目上大力推銷。此專輯有了別於市場的突破曲風。風格融合了R&B、Hip-Hop、古典和中國風[7]，初步建立了周杰倫的「周式」歌手形象。[7]。周杰倫在金曲獎頒獎典禮上稱：「沒有吳宗憲就沒有周杰倫」。周杰倫除了為自己製作、輯印音樂專輯外，亦曾經替其它歌手作曲，如知名歌手S.H.E.、陳小春、劉德華等。2001年9月發行個人第二張專輯《范特西》，專輯名稱來自英文「Fantasy」的音譯[10]；憑藉這張專輯周杰倫在2002年度臺灣第13屆金曲獎頒獎典禮中斬獲「最佳作曲人獎」、「最佳專輯製作人獎」以及「最佳流行音樂演唱專輯獎」等五項大獎。[11]。2002年7月發行個人第三張專輯《八度空間》；9月28日個人首次世界巡迴演唱會「THEONE」於臺北市立體育場拉開帷幕。2003年2月，出道僅三年便接受美國《時代》雜誌專訪，並成為亞洲版的封面人物[7]；周杰倫是繼王菲、張惠妹之後，第三位出現在《時代》雜誌亞洲版封面的華人歌手，並被該雜誌讚譽為「新一代亞洲流行天王」[7]；2003年7月，全亞洲超過50家電台定7月16日為周杰倫日，並同步首播其第四張個人新專輯《葉惠美》中的主打歌曲《以父之名》[12]，此後每張專輯必定有一首中國風的歌曲。2004年7月發行個人第五張專輯《七里香》，並憑藉該專輯首次獲得世界音樂大獎「大中華區最暢銷藝人」[13]；同時，根據國際唱片業協會IFPI的統計，專輯七里香銷量位居年度世界第42位，[14]；同年以歌曲《龍拳》首次亮相春節聯歡晚會。2005年11月發行個人第六張音樂專輯《11月的蕭邦》，自這張專輯周杰倫開始作為音樂總監，並嘗試執導一些自己歌曲的mv；6月23日，主演的電影處女作《頭文字D》全國上映，並憑藉該電影一舉獲得香港電影金像獎，臺灣電影金馬獎雙料最佳新演員獎[15][16]。2006年9月發行個人第七張音樂專輯《依然范特西》，專輯中的中國風歌曲《千里之外》更是請來費玉清一起合唱。2007年4月，由周杰倫與多年合作夥伴方文山、楊峻榮三人共同創辦的杰威爾音樂（JVR）有限公司成立；11月2日，發行個人第八張音樂專輯《我很忙》，11月24日周杰倫在中國上海八萬人體育場展開個人第三次世界巡迴演唱會，與此同時，周杰倫的「THEONE」、「無與倫比」兩次世界巡迴演唱會已先後在美國康乃狄克州、洛杉磯、拉斯維加斯、加拿大、澳大利亞、日本東京、新加坡、馬來西亞吉隆坡、泰國曼谷、香港、臺灣、中國大陸等多個國家地區舉辦多場。2008年發行第九張專輯《魔傑座》，2008年1月10日，周杰倫個人自導自演的電影《不能說的秘密》在韓國上映，2月16日，在日本武道館連開兩場演唱會，成為繼王菲之後第二位在武道館開唱的華人歌手；9月，繼藝人王菲、王力宏、張惠妹、金城武、F4後，成為美國有線電視新聞網CNN第六位專訪的華人明星[17]；同年《青花瓷》歌詞成為中國山東、江蘇兩地高考考題，之前周杰倫的《蝸牛》、《上海1943》、《聽媽媽的話》等歌曲已相繼被收錄於中小學教科書中，或成為愛國主義教材，而《髮如雪》更是被編入日本《通過唱歌記住中國話》中；11月，憑藉專輯《我很忙》獲得在摩納哥舉辦的世界音樂大獎所頒發的「大中華區最暢銷藝人」獎，連續三屆（2006年、2007年、2008年）獲獎，打破之前歌神張學友兩連冠的紀錄，加上2004年，周杰倫已先後獲得四次世界音樂大獎「大中華區最暢銷藝人」獎。[18]。2009年7月，個人第三次世界巡演進入尾聲，其中澳洲站雪梨演唱會票房空降美國看板。第二；12月入選美國CNN評選的「亞洲最具影響力的25位人物」，並被形容為「非凡藝人」[19][20]；12月10日，美國知名電影網站ScreenCrave評選出的「全球十大最值得期待的新秀演員」中出現周杰倫，使他成為首位進軍好萊塢的臺灣藝人。[21]。2010年，諾基亞下載量調查的「全球歌曲下載量最高歌手」為手機銷售量。在（2010年1月1日至2010年8月10日）中，手機下載量排名全球第三，僅次於女神卡卡、麥克·傑克森[22][23]；同年，入選美國商業雜誌《FastCompany》評選的「全球百大創意人物」，與女神卡卡、Jay-Z成為「唯三」入榜的歌手[24]；2月，自導自演的電視劇《熊貓人》陸續在臺灣及中國大陸上映；12月，國際小行星命名中心批准，正式將小行星257248命名為周杰倫星（Chouchiehlun）。2011年1月14日，周杰倫參演的美國3D電影《青蜂俠》在全美正式上映並於1月28日在台灣上映[25]；2月，周杰倫與NBA籃球巨星科比拍攝雪碧廣告，同時創作廣告主題曲《天地一鬥》，並邀科比出鏡一同合拍MV，該歌曲於2011年2月21日在美國加州洛杉磯首發[26]；4月21日，美國《時代》雜誌評出2011年「全球最具影響力人物100強」，票選階段周杰倫位列第二。2012年5月，登上福布斯中國名人榜第一名[27]；9月22日，周杰倫在新加坡F1（世界一級方程式錦標賽）賽道開唱。12月28日，周杰倫發行個人第十二張全新專輯《十二新作》。2013年5月17日，周杰倫個人第四次世界巡迴演唱會「魔天倫」在中國上海奔馳文化中心啟動；7月11日，周杰倫個人第二部自編自導自演的電影《天台》全面上映；周董所屬的臺北新生命小組教會舞團於7月10日在《天台》首映會上演「天台歌舞秀」，吸引眾多媒體與民眾注意，同時該片也受到了中國知名導演張藝謀的好評。2014年12月初，周杰倫、李宗盛與中國百老匯達成簽約，將與中國百老匯、美國百老匯合作之大型音樂劇，採用1999年時根據ABBA樂團作品創作《媽媽咪呀！》大獲成功的「口水歌音樂劇」形式（英文原文為CompilationMusicals，也被稱為JukeboxMusicals，以選取某一位知名歌手或演唱團體的音樂作品，再加以一個非常吸引人的全新創作故事，用音樂劇的方式做呈現），將周杰倫和李宗盛的經典歌曲進行結合，創作一部華麗的音樂歌舞劇。[28]2014年12月26日，發行個人第十三張音樂專輯《哎呦，不錯哦》。2015年1月29日，新婚後的周杰倫在微博透露他將成為《中國好聲音》第四季導師[29]。也開始展開電影《出神入化2》的拍攝。5月11日，舉行記者會宣布擔任電影《一萬公里的約定》製片人，預計2016年夏季全球上映。6月2日，《中國好聲音4》舉行發布會，周杰倫透露由他領導的團隊選手中，官方已決定保留一名席位參演正在籌備中的音樂歌舞劇。而周杰倫也將擔任該片總導演。2015年9月22日，周杰倫將加盟《功夫熊貓3》的配音，而他飾演的角色為五位功夫大師之一的金猴。隨後，在同一天的19點38分，「周杰倫歌迷網官方微博」確認此消息，寫道：「周杰倫正式加盟電影《功夫熊貓3》『金猴』配音。這也是周杰倫第二次參與配音（第一次是十萬個冷笑話）據悉，電影於2016年1月29日於美國和中國上映。2016年6月24日，發行個人第十四張音樂專輯《周杰倫的床邊故事》。2017年周杰倫於咪咕音樂盛典2017年11月4日，周杰倫為英雄聯盟2017賽季全球總決賽擔任開場嘉賓，演唱《英雄》，及彈鋼琴伴奏演出該屆主題曲《LegendsNeverDie》。2018年1月18日，為慶祝自己39歲的生日，特別花了七天的時間錄製了一首單曲，歌名是《等你下課》，也是送給粉絲的禮物。4月7日，在澳洲巡演受訪時表示計劃每3個月發1首單曲，「跟我以往每年發1張專輯不太一樣，這樣的方式能讓每1首歌的關注熱度比較高，更貼近歌迷」。4月16日，他在官方Instagram預告再過一周將發表新歌，歌名是《不愛我就拉倒》。後來因為忙於演唱會，於4月24日才開始錄製程序，5月8日在官方Instagram透過杜哥（杜國璋）宣布5月15日正式首播單曲。對於周杰倫而言，進入電影界是一個出乎意料的發展[30]。他的高中英語老師認為他不能夠處理好面部表情。2003年，周杰倫客串一部電影《尋找周杰倫》的導演說，他強烈的個人風格不會讓他成為一個好演員[31]。2005年，周杰倫的第一個電影角色是在《頭文字D》中擔任男主角，正式進入電影界。這可以推出他的首部作品，並使他接觸到日本的觀眾[32]；這部電影是根據日本漫畫頭文字D改編，周杰倫扮演藤原拓海，一個安靜地、很少表達自己的天才車手。有些評論家批評他的表演淡而無味[33]，而一些人認為他表現自然，但卻是因為角色與本人相似而只是在演自己[34][35]；他在《頭文字D》的表現贏得了香港電影金像獎和金馬獎的最佳新人獎[36][37]。此後他還演了其他六部電影，客串了3部電影導演、一部影片和數十個MV。周杰倫曾經說過：「我因為音樂而生活」[38]，涉足電影業是因為他覺得自己需要一個新的挑戰。而歌迷們擔心的是，電影事業會對他的音樂生涯造成影響。周杰倫一再保證，電影是靈感的來源，不會分心。同時，他也意識到有必要平衡自己的事業[30][39][40]。2006年，周杰倫在他第二部電影《滿城盡帶黃金甲》中他飾演二王子元杰，在電影中他試圖表現了中國的傳統美德——「孝」，也是他個性的縮影。這一部在國際上發行的電影讓北美觀眾首次看到周杰倫。中國的電影評論家對他的表演的評論從「缺乏層次及張力」[41]到「未失水準」[42]，西方影評則認為其演技十分一般[43][44][45][46][47]。他在《滿城盡帶黃金甲》的表現被提名2007年第26屆香港電影金像獎最佳男配角[48]。2007年，周杰倫第一部自編自導自演的電影《不能說的·秘密》上映，電影裡大部分的音樂也由周杰倫創作，在這部電影中他充分發揮了自己的鋼琴天分，愛上了一個穿越時空到現在的女孩。2008年，周杰倫在《功夫灌籃》扮演一個功夫學校的天才學生。2009年，周杰倫與當代臺灣名模林志玲合拍《刺陵》並擔任男主角[49]。2011年，周杰倫在美國三維電影《青蜂俠》擔任青蜂俠助手「Kato」的角色，是他在好萊塢的處女作。[50]此外他的第二張專輯《范特西》裡面的經典歌曲《雙截棍》被採用於青蜂俠電影的片尾曲，在全球放送。[51]2013年7月11日在臺灣、中國大陸、新加坡同步上映的《天台》，是周杰倫繼2007年《不能說的·秘密》後，構思整整六年後的第二部自編自導自演的電影作品，女主角為李心艾，同時該片也邀請到曾志偉、鐘鎮濤，柯有倫等眾多圈內好友助陣。[52]2014年11月5日好萊塢電影《出神入化2》，在官方網站公布演員陣容，周杰倫繼《青蜂俠》後再度參演好萊塢電影，已在2016年6月上映。他為該片製作片尾主題曲《NowYouSeeMe》並收錄於個人專輯。同時他的歌曲《公公偏頭痛》與《鞋子特大號》也被導演放入電影中做為彩蛋。[53]2015年5月11日在台北舉行記者會宣布擔任電影《一萬公里的約定》製片人，由獲坎城影展肯定的華裔好萊塢新銳導演洪昇揚執導，2016年12月至隔年1月陸續於台灣、大陸與香港上映。2017年，周杰倫宣布投入電影《靠譜兄弟》製片人，並欽點台灣知名歌手蕭敬騰擔任男主角。5月蕭敬騰證實參演，6月初進行培訓，暫定月尾開拍，劇情80%場景於馬來西亞拍攝。遺憾的是，這部片最終因資金問題暫時停拍。2018年，曾經與周杰倫打造其第二部自導自演電影長片《天台》的創映電影總經理劉畊宏與量能文創執行長彭康育宣布合作「創能計劃」，投資拍攝賽車電影《叱吒風雲》，並預計邀請阮經天作為男主角。周杰倫則坦言這是因為《頭文字D》續集擱淺而產生的念頭。周杰倫的副業版圖從投資餐廳開始。2006年，周杰倫因為想有個和朋友聚會、與歌迷貼近的場所，和朋友合資開了「Mr.J義法廚房」，爾後「Mr.J」成為周杰倫副業的主要核心。同年周杰倫再接再厲，擴張版圖至潮牌市場，他與國中同學蔣先威合作開設潮牌店PHANTACi，並在海內外設立分店，2012年初，他大手筆斥資3,000多萬元人民幣（1.5億元台幣），與西安真愛投資集團合作，開了「JaysFantasy」KTV。廣受粉絲歡迎。周杰倫的餐廳之路並沒有因而歇腳。他投資了台北華山的「Déjàvu音樂魔幻餐廳」，更以電影「不能說的秘密」以及「頭文字D」主題開設「Mr.J義法廚房」分店。2013年，以他自導自演的電影《天台》為主題的餐廳「天台食堂」在台北捷運忠孝新生站附近開張。同年他更透過網路深入中國大陸市場，「Mr.J」正名為「MR.J」並延伸經營潮牌服飾、生活用品、文創、動漫產品，甚至架設自己的網站，建立平台「JConcept星品庫」。現在不僅和多位藝人潮牌合作，就連愛妻昆淩潮牌「WOOF!」也加入，透過網路行銷，總營業額已達上千萬。此外，昆凌2016年也在西門町開了MachiDoggieFashion&Coffee，起初由MR.J幫忙策畫，現在則是全由昆凌掌管。妙的是，店面開張時，沒大費周章舉辦開幕儀式，而是默默進行，就連周董都表明：「低調地進行。」副業看似平穩，卻因客戶群長期以來皆為「固定粉絲」，2015年，周杰倫因而選擇退股「Déjàvu音樂魔幻餐廳」以及「天台食堂」。孰料，在周杰倫退股之後，生意更趨慘淡。「天台食堂」於不久後宣告永久停業。「Mr.J義法廚房」也因租約期限截止而需另尋他處。周杰倫不得不重新審思自己的經營之道。在經過朋友的耳濡目染及個人嗜好下，周杰倫被傳出已經接觸了電競遊戲「英雄聯盟」許久。果然在2015年，周杰倫開始擔任了中國大陸「英雄聯盟」代言人。他趁勝追擊投入電競業，以MR.J之名成立電競戰隊，並即將成立電競公司，前途備受看好。2016年4月19日，周杰倫舉行記者會，宣布取得台北暗殺星的經營權，並兼任隊長，同時將其改名為「J戰隊」(JTeam)。"
}